**Портирование любых моделей** [Model.cfg]

Кто собирается пихать любую модель, вы должны использовать *model.cfg*. Без него никуда вам. Вы будете создавать селекторы [Selection] на которые потом будете прикреплять текстуры или анимации, создавать кости из них и.т.д 

Запомните важное правило, всегда вы должны расписывать в *CfgModels* -  селекторы на текстуры. Объясняя Арме что это новый предмет со своими костями или областями. 

||**Без этого у вас не будет текстура, а главное вы не сможете делать ретекстур на модели**||

**Пример** 

```sqf
class CfgModels
{
    class Default;
    class Box : Default //Где box это название p3d файла
    {
        sections[] = {"camo1"}; // cелекторы
    };
};
```
